content/posts/p5.md
+++
author = ["donald lo"]
description = "Some description for this post."
date = 2017-07-20
tags = ["single", "toml", "cross-link"]
categories = ["cat1", "cat2"]
draft = false
[menu]
  [menu.foo]
    parent = "main"
    weight = 10
    identifier = "single-toml"
+++

This is a single post. You do not need to set the `EXPORT_FILE_NAME`
property in here. But then you also lose the tag and property
inheritance Org awesomeness.
你的生活1


## First heading in this post {#first-heading-in-this-post}

This is a under first heading.


## Second heading in this post {#second-heading-in-this-post}

This is a under second heading.


## Cross-linking {#cross-linking}

All of the below linked Org files **have to have** exported posts using
the _per-file_ flow, and they **cannot be** page bundles or have set a
different `#+export_file_name` --- See `ox-hugo` Issue #[131](https://github.com/kaushalmodi/ox-hugo/issues/131) for
requirements for this basic cross-linking to work as expected.


### Link to file in the same directory {#link-to-file-in-the-same-directory}

This file will export the front-matter in TOML (default). See


### Link + Description {#link-plus-description}

front-matter]].


### Link to file in a different directory {#link-to-file-in-a-different-directory}


### Link to file that has a Hugo slug set {#link-to-file-that-has-a-hugo-slug-set}

This one is magic! You can link to the Org file, no matter what slug
is set in the exported file.. Hugo will do the job of translating from
the Markdown file name to the actual link/slug.
afdjakjfksa

file

生活是什么


### Link to the CUSTOM_ID of a different file {#link-to-the-custom-id-of-a-different-file}
